app/views/diaries/index.html.erb

    </div>
        <% Diary.all.each do |d| %>
---
SELECT "diaries".* FROM "diaries"