app/views/photos/index.html.erb


      <% Photo.all.each do |photo| %>
---
SELECT "photos".* FROM "photos"