app/controllers/diaries_controller.rb

  def index
    @diaries = Diary.all.order('created_at desc')
    @diaries_count = current_user.diaries.length
---
SELECT "diaries".* FROM "diaries"